<a href="https://colab.research.google.com/github/Sanyam0101/PYTHON-data-SCIENCE-NOTEBOOKS/blob/main/missing_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np
pd.Series([1,2], dtype=np.int64).reindex([0,1,2])

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
pd.Series([True,False],dtype=np.bool_).reindex([0,1,2])

0     True
1    False
2      NaN
dtype: object

In [7]:
pd.Series([1,2],dtype=np.dtype("timedelta64[ns]")).reindex([0,1,2])

0   0 days 00:00:00.000000001
1   0 days 00:00:00.000000002
2                         NaT
dtype: timedelta64[ns]

In [10]:
pd.Series([1,2],dtype=np.dtype("datetime64[ns]")).reindex([0,1,2])

0   1970-01-01 00:00:00.000000001
1   1970-01-01 00:00:00.000000002
2                             NaT
dtype: datetime64[ns]

In [11]:
pd.Series(["2020","2020"],dtype=pd.PeriodDtype("D")).reindex([0,1,2])

0    2020-01-01
1    2020-01-01
2           NaT
dtype: period[D]